timdoug/cyd_clock/sdkconfig.defaults
# ESP32 Target
CONFIG_IDF_TARGET="esp32"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# LWIP
CONFIG_LWIP_SNTP_MAX_SERVERS=3
CONFIG_LWIP_IPV6_AUTOCONFIG=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# RTC clock: use internal 8.5MHz oscillator / 256 (more accurate than RC)
CONFIG_RTC_CLK_SRC_INT_8MD256=y
# 8x default: longer calibration at boot for more accurate RTC tick measurement
CONFIG_RTC_CLK_CAL_CYCLES=8192

# SPI flash (CYD uses Boya chip)
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y

# SPI RAM (CYD doesn't have PSRAM, disable)
CONFIG_SPIRAM=n

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
